[
{"text": ["\n\t", "\n", "\n\tRelatively big price movement today as Bitcoin moved up from ~$630 to 650-670 depending on where you trade. \n", "\n\tA couple potential reasons for this are: \n", "\n\tWhat do you think? Currency fleeing China, or confidence from miners meeting, or something else?\n"]},
{"text": ["\n\tIt was some nice movement that looked like natural growth ", "\n\tI would say say it may be currency fleeing china into BTC it would be nice to see $1,000 Again. What are you thoughts and hopes?\n"]},
{"text": ["\n\tSeems like altcoin volume is really drying up on Poloniex. Maybe an indication that people want to wait and see what will happen with BTC before moving in or out of alts. Could be a good sign I think...\n"]},
{"text": ["\n\tIn my opinion it will be above 1000$ by january next year, i don't know about november but i'd guess it won't go up too much.\n"]},
{"text": ["\n\tAt the end of nov think will go around 800$. dont have the why is just a feeling "]},
{"text": ["\n\tI don't think we'll ever see Bitcoin over $1200 USD again, but please make me wrong.\n"]},
{"text": ["\n\t\t\tAt the end of nov think will go around 800$. dont have the why is just a feeling ", "\n\tI think that's how everyone speculating on the market is thinking...\n", "\n\tThe thing is there is no real reason as to why Bitcoin should be increasing in value up that much... there hasn't been any crazy cool things happening in the Bitcoin space for a while.  The only thing I can think of is the continued volatile economy in places like China.\n"]},
{"text": ["\n\t\t\tI think that's how everyone speculating on the market is thinking...\n\t\t", "\n\t\t\tThe thing is there is no real reason as to why Bitcoin should be increasing in value up that much... there hasn't been any crazy cool things happening in the Bitcoin space for a while.  The only thing I can think of is the continued volatile economy in places like China.\n\t\t", "\n\ttrue, nothing has happened. the only thing happening is blockchain technology being researched intense in banks and big companies.\n"]},
{"text": ["\n\tI dont think we will see $1100+ again..... doesnt seem to be alot of big development for the project, other coins will see the same price id say in 1 - 2 years.... But i wonder what the price will do if and when BTC becomes more mainstream? will it dilute but due ti the cap of 21m coins maybe it will hold strong?\n"]},
{"text": ["\n\t\t\tI dont think we will see $1100+ again..... doesnt seem to be alot of big development for the project, other coins will see the same price id say in 1 - 2 years.... But i wonder what the price will do if and when BTC becomes more mainstream? will it dilute but due ti the cap of 21m coins maybe it will hold strong?\n\t\t", "\n\tI don't think price increases will follow if BTC becomes more \"mainstream\", if you are thinking about it in terms of being accepted on Ebay or some other big time name starts accepting it; but perhaps proves itself to be more \"cost effective\" and \"convenient\" for African nations who are using things such as BitPesa instead of their national currency.  Following this example, entrepreneurs in countries like Ghana are very interested in cryptocurrencies to act as a hedge against their inflated currency and to be able to accept money/transfer money out of the country easily and cheaply... Western Union and inflation of their currency is robbing these kinds of people.\n", "\n\tI see it more crucial that people poor countries like these to start switching to cryptocurrencies in general in order to 1) cheaply accept/transfer wealth across borders easily, and 2) hedge against their exponentially inflated currency; in order to see any real dramatic effect in demand/price soon. \n", "\n\t \n", "\n\tEdit: ", "\n"]},
{"text": ["\n\t\t\tI don't think price increases will follow if BTC becomes more \"mainstream\", if you are thinking about it in terms of being accepted on Ebay or some other big time name starts accepting it; but perhaps proves itself to be more \"cost effective\" and \"convenient\" for African nations who are using things such as BitPesa instead of their national currency.  Following this example, entrepreneurs in countries like Ghana are very interested in cryptocurrencies to act as a hedge against their inflated currency and to be able to accept money/transfer money out of the country easily and cheaply... Western Union and inflation of their currency is robbing these kinds of people.\n\t\t", "\n\t\t\tI see it more crucial that people poor countries like these to start switching to cryptocurrencies in general in order to 1) cheaply accept/transfer wealth across borders easily, and 2) hedge against their exponentially inflated currency; in order to see any real dramatic effect in demand/price soon. \n\t\t", "\n\t\t\t \n\t\t", "\n\t\t\tEdit: ", "\n\t\t", "\n\tGreat Post, very interesting!\n"]},
{"text": ["\n\tI also think that Bitcoin is interesting for developing countries because people there don't have easy access to 'reference' currencies like USD or EURO so they can't buy or sell on the Internet\n", "\n\tTo get back to the subject, I think that Bitcoin price is going to be close to $700 on November\n"]},
{"text": ["\n\t\t\tI also think that Bitcoin is interesting for developing countries because people there don't have easy access to 'reference' currencies like USD or EURO so they can't buy or sell on the Internet\n\t\t", "\n\t\t\tTo get back to the subject, I think that Bitcoin price is going to be close to $700 on November\n\t\t", "\n\thaha Thanks! wow i cant believe you can bet on it..... i should put one down for trump to win!\n"]},
{"text": ["\n\tLooks like some upward movement today. Just need 5% more increase in 5 days or so to get over $700.\n"]},
{"text": ["\n\tAnother speculative bubble in Bitcoin markets?\n", "\n\tI think that the price is going to drop soon\n"]},
{"text": ["\n\tmy opinion is : for the end of November, Bitcoin will reach 700 / 750 $ .\n", "\n\tit will go to the moon , definitively, but not before 3 years from now ( maybe  4 ) ... \n", "\n\tthis will happen when mass adoptions will happen.. not before. \n", "\n\twe have already assist to blockchain system mass adoption ( to his start at least..) : 2017 will be ( in my humble opinion an increase of this blockchain adoption , by most of fiat banks..\n", "\n\t \n", "\n\tdefcon23\n"]},
{"text": ["\n\t \n", "\n\tFrom its inception bitcoin is  climbing, I assume like all things values fluctuate, but the trend is always increasing. I hope it keeps going up ", "\n\tI wonder if the value of bitcoin will increase/decrease depending on the outcome of the U.S. Elections, as well as the day of the election, Nov 8th.  Also, knowing that the United States economy is artificially propped using quantitative easing.  If the US dollar decreases in value, would the value of bitcoin go up?  Fast forward into the future where I think most country want to adopt a digital currency and get rid of paper money, is it possible that bitcoin becomes ", " digital currency of the future since its so well established?\n", "\n\t \n"]},
{"text": ["\n\tCan bitcoin really become mainstrem? I have some doubts:\n", "\n\tIt's volatile and unstable\n", "\n\tIt has no store of value (it isn't predictably useful when retrieved after storage)\n", "\n\tWhy should I pay in btc what I can easily pay in dollars, euros...?\n", "\n\tIf its value tends to increase (deflation), people won't spend it (bitcoin is a placement, not a trade currency)\n"]},
{"text": ["\n\tHow do you think the fact Bitcoin has a limit of 21 Million coins will effect the price.... i dont think it could ever really be mainstream due to that fact, and with it being so volatile. who would rock up at a coffee shop and pay  0.0058 BTC for a coffee?  \n"]}
]